tutorials/lagrangian/buoyantReactingParticleFoam/hotBoxes/0/wallFilmRegion/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/wallFilmRegion";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // top film surface
    "(.*top)"
    {
        type            slip;
    }

    // mapped boundaries
    "(region0_to.*)"
    {
        type            slip;
    }

    // floor sides
    walls
    {
        type            noSlip;
    }
}

// ************************************************************************* //
